app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "email", "lease_id", "password_salt", "persistence_token", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password_salt" = 'ea2qEbK4z3x39qa6Do9T', "crypted_password" = '3ec946792a301600da4c7a031b89def0a1ad961d266d20742c7dd56a837a1583e266ab22f5203434da27ddc45b1dd3717e17aca1f6639ddb19db879e1c9988f1', "persistence_token" = '07e07bb3e34af76063379195d65fa94ebecb8c0e3d1c6186c4f892a40dbb15befd5fb9e2d08d891cef2dba6f4a66c4099a43ebf8b21dd41db194ec77f9f5468b', "updated_at" = '2013-02-13 19:12:58.112928' WHERE "users"."id" = 4
---
  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]
---
  def destroy
    @user = current_user
    @user.destroy